from fps import*

player = make_hero(
	name="вася",
	inventory=[
		{
			"тип": "меч",
			"название": "меч кладенец",
			"свойство": "атака",
			"цена": 500,
			"модификатор": 50
		},
		{
			"тип": "щит",
			"название": "щит красный ромб,синяя полоса",
			"свойство": "защита",
			"цена": 400,
			"модификатор": 50
		},
		{
			"тип": "продукт",
			"название": "зелье здоровья",
			"свойство": "здоровье",
			"цена": 5,
			"модификатор": 10
		}
	]
	)	
recalculate_stats(player)	
game = True
while game:
	visit_hub(player)